def convert_chanakya_to_unicode(textACD):

    array_one = [
      "¤","U",

      "¢ð","´ð","ð¸",
        
      "¥æò","¸",
      "¸·", "¸¹", "¸»", "¸Á","¸Ç", "¸É", "¸È","¸Ø","¸Ú","¸Ù",
      
      "A","B","C","D","E","F","G","H","I","J","K","L","M",
      "N","O","P","Q","R","T","V","W","X","Y",
      "`","a","b","d","e","f","g","h","i","j","k","l","m","n","p","q","r","s","t","u",

      "žæ","ž","#","%","@",
      "„","¦","¨","¯","µ","º",

      "Cþ","q","Ê","u","g",    
      "Ÿæ","Åþ","Çþ","Éþ", 
      "^","h","Ð","ý","þ",
      
      "¥ô","¥æð","¥õ","¥æñ","¥æ","¥","§Z","§ü","§","©","ª","«","¬","­","°ð","°",

      "€", "·", "",  "¹", "‚æ", "‚", "»", "ƒæ", "ƒ", "¾", 
      "“æ", "“","‘æ", "‘","¿","À", "”æ", "”", "…æ", "…", "’æ", "’","Á","Ûæ","Û","†æ","†",

      "Å","Æ","Ç","É","‡æ","‡",
      "ˆ","Ì", "‰æ", "‰","Í","Î","¼","Š","Ï","óæ","ó","‹æ","Ù","‹",

      "Œ","Â","","È","Ž","Õ","","Ö","","×",
      "Ä","Ø","Ú","Ë","Ü","¶","Ý","Ã","ß",
      "àæ","³æ","o","³","à","c","á","S","â","ã","±",
      "ÿæ","ÿ","˜æ","˜","™æ","™","üð´",
      
      "æò","æñ","æ","è","é","ê","ä","å","ë","ì","í","Ô","ñ","ô","õ",
      "¢","´","¡","Ñ","¸","ò","ù","÷","ð",

      "0","1","2","3","4","5","6","7","8","9",
      "®","v","w","x","y","z","{","|","}","~",
      "्ो","्ौ","्ाे", "्ाा","ाे","ाे","ाै","्ा","ंु","ओे","ोे","ाे","ईंं",
      
      "'","&","_","","²","ö","ú","ï","–","−",
      "ÒÒ","ÓÓ","Ó","Ò","Ÿो","Ÿौ"]

    array_two = [
      "","",

      "ð¢","ð´","¸ð",

      "ऑ","फ़्", 
      "क़","ख़","ग़","ज़","ड़","ढ़","फ़","य़","ऱ","ऩ",

      "्र","क्च","ष्ट","ष्ठ","श्व","स्न","त्र","॥","ढ्ढ","छ्व","्य","रु","रू",
      "हृ","ह्र","क्क","क्त","क्र","ञ्ज","ङ्क","ङ्ख","ङ्ग","ङ्घ",
      "क्व","ड्ड","ड्ढ","स्र","द्ग","द्घ","द्द","द्ध","द्ब","द्भ","द्म","द्य","द्व","ठ्ठ","श्च","ह्न","ह्म्","ह्य","ह्ल","ह्व",
      
      "त्त","त्त्","प्त","त्न","ञ्च",
      "ल्ल","ष्ट्व","¨","ख्न","द्ब्र","ख्र",

      "ष्ट्र","ह्न","ज़्","ह्व","द्द",  
      "श्र","ट्र","ड्र","ढ्र",
      "ट्ट","द्ध","।","्र","्र",
      
      "ओ","ओ","औ","औ","आ","अ","ईं","ई","इ","उ","ऊ","ऋ","ॠ","ऌ","ऐ","ए",

      "क्", "क","ख्","ख","ग","ग्","ग","घ","घ्","ङ",
      "च्च", "च्च्","च","च्","च","छ","ज्ज","ज्ज्","ज","ज्","ज","ज्","ज","झ","झ्","ञ","ञ्",

      "ट","ठ","ड","ढ","ण","ण्",
      "त्","त","थ","थ्","थ","द","द","ध्","ध","न्न","न्न्","न","न","न्",

      "प्","प","फ्","फ","ब्","ब","भ्","भ","म्","म",
      "य्","य","र","ल्","ल","ल","ळ","व्","व",
      "श","श","श","श्","श्","ष्","ष","स्","स","ह","ह्",
      "क्ष","क्ष्","त्र","त्र्","ज्ञ","ज्ञ्","ðZ",

      "ॉ","ौ","ा","ी","ु","ू","ु","ू","ृ","ì","í","े","ै","ो","ौ",
      "ं","ं","ँ","ः","़", "ॅ","ऽ","्","े",

      "०","१","२","३","४","५","६","७","८","९",
      "","1","2","×","4","5","6","7","8","9",
      "े", "ै", "े","ा","ो","ो","ौ","","ुं","ओ","ो","ो","ईं",

      "%","×","ट्ठ","स्त्र","दृ","ह्ण","ॐ","","ङ्क्त","ऌ",
      "“","”","’","‘","श्रे","श्रै"]

    array_one_length = len(array_one)
    modified_substring = textACD
    
    if(modified_substring == "" ):
      return "noInputDetected"
    
    for i in range(array_one_length):
        modified_substring = modified_substring.replace(array_one[i] , array_two[i] )

    # break matra-combinations in chanakya
    modified_substring = re.sub(r"¨(.)((्.)*)" , "ç\g<1>\g<2>ं" , modified_substring)  #like in nrisimha       - i+bindu together
    modified_substring = re.sub(r"í(.)((्.)*)" , "ç\g<1>\g<2>ü" , modified_substring)  #like in varjit         - i+r on top
    modified_substring = re.sub(r"ì(.)((्.)*)" , "ç\g<1>\g<2>Z" , modified_substring)  #like in kirtim farming - i+r+bindu ; Z = r+bindu
    modified_substring = modified_substring.replace("Z" , "üं" )                       #like in कर्कंधु,पूर्णांक     - Z=r on top + bindu

    # code for replacing  "ç"   with "ि" (chhotee ee kii maatraa) and correcting its position too.
    modified_substring = re.sub(r"ç(.)((्.)*)" , "\g<1>\g<2>ि" , modified_substring)  

    # Eliminating "ü"(reph) and putting 'half - r' at proper position for this.
    modified_substring = re.sub(r"((.्)*)(.)([ािीुूृेैोौंःँॅ]*)ü" , "र्\g<1>\g<3>\g<4>" , modified_substring)  
    return modified_substring
    
textACD = "Ÿæè×Î÷Ö»ßÎ÷»èÌæ ØÍæM¤Â"
print(convert_chanakya_to_unicode(textACD))
